Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyDuplicates Property
 Can't paste duplicate types. Only non duplicate types will be pasted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyDuplicates { get; }
Public Shared ReadOnly Property CannotCopyDuplicates As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyDuplicates {
	FailureDefinitionId^ get ();
}
static member CannotCopyDuplicates : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace